{"posts":[{"title":"课程测评","text":"给以后的人一些提示与提醒。 大一上汉英翻译理论与实践教课老师： 余苏凌(ysl)最终得分：Pass（期中81） 任务量很大， 然后我期中考的也不很好，所以直接选择了pf，如果词汇量不是很大的人慎选，老师很温柔但是会用抽人起来翻译的方式来点到，后半学期基本改网课所以还算比较水，期末的话感觉把上课的内容搞会其实还能拿到正态及以上的分数，对自己英语有信心的可以冲一手。 计算概论A教课老师： 刘譞哲(lxz)最终得分：97 感觉这门课任务量其实很大，对于新手的话可能上手很难，如果高中是OI选手可以比较轻松的对应这么课。 每周大概需要花2h以上的时间完成作业，但是有习题课和上机可以让助教教教你，所以总的来说任务量还算可以。 比较搞的是大作业，建议自学一下图形化这样子才能够拿到更高的分数，但是我没有写大作业，也拿到了97分所以其实也没那么重要，比较重要的是卷算法，建议去看看排名靠前的开源代码，然后自己理解一下，因为这样性价比非常高。","link":"/2023/01/03/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"},{"title":"线性代数上册","text":"原本以为的最后一门考试，结果是倒数第3门 第一章矩阵消元法定理1：任何一个矩阵可以变成阶梯形矩阵再变成简化阶梯形矩阵。 主变量：以主元为系数的未知量自由未知量：其余未知量 可行解：符合实际问题的解 解的情况和判别标准 无解：出现$0=d$ 非零行个数$r &lt;n$：无穷多个解 非零行个数$r =n$：唯一解 有解称该线性方程组相容，否则为不相容 推论1：$n$元齐次线性方程组有非零解的充要条件为$r&lt;n$ 推论2：如果方程个数小于变量个数，则$n$元齐次线性方程组有非零解证明：$r\\le s&lt;n$，套用推论1即可。 数域数域：复数集的一个子集$K$,如果满足对于四则运算封闭，那么就是一个数域。其中,$0,1\\in K$ 第二章$n$元排列$\\tau(a_1,a_2,\\cdots,a_n)$表示一个排列的逆序对数。 排列的奇偶性等于逆序对数的奇偶性。 定理1：对换改变$n$元排列的奇偶性。证明：考虑对于两个位置$i,j$，对换所需要的次数是$j-i+j-i+1$，明显是个奇数。又因为对换相邻两个数排列奇偶性改变，所以证毕。 定理2：任一$n$元排列与排列$12345…n$可以经过一系列对换互变，且该排列奇偶性与对换次数奇偶性相同。证明：略。 行列式$\\det A=\\sum_{i_1,\\cdots,i_n}-1^{\\tau(i_1,\\cdots,i_n)}a_{i_1,1}…a_{i_n,n}$ 行列式的性质性质1：$\\det A=\\det A^T$ 性质2:某一行都是$k$的倍数，那么设该行除以$k$之后的矩阵为$B$，则：$\\det A=k\\det B$ 性质3：某列为两个列向量相加，那么行列式可以拆成两项。 性质4：交换两行，行列式反号。 性质5：两行相同，行列式为$0$ 行列式求解： 直接暴力解 化成上三角 变成若干的和 如果各行元素和相同，把后面的列全部加到第一列 按某行|某列展开 归纳法 递推关系式 升阶法（加行加列） 利用范德蒙德行列式 光说的话就是这一堆方法，具体运用起来，考虑如果某一个方法不可行就换一个。 比如说三对角行列式就先尝试方法4，再试试方法7，发现就可以解出来了。 克拉默(Cramer)法则如何判断一个线性方程组是否有解$\\rightarrow |A|\\ne 0$。 拉普拉斯定理按照$k$行展开，对应的行列式的值为 $$|A|=\\sum_{j_1,j_2,\\cdots,j_k}A \\begin{pmatrix}i_1,i_2,\\cdots,i_k\\newline j_1,j_2,\\cdots,j_k \\end{pmatrix} -1^{i_1+\\cdots+i_k+j_1+\\cdots+j_k}A \\begin{pmatrix} i’1,\\cdots,i’{n-k}\\newline j’1,\\cdots,j’{n-k} \\end{pmatrix}$$ $k$列同理，做个转置即可。 第三章规定记号$&lt;a_1,…,a_s&gt;$表示$s$个向量张成的子空间。 等价：${a_1,…,a_s}\\cong {b_1,…,b_r}$，当且仅当这两个向量组可以互相线性表出。 引理和推论若${\\alpha_1,\\alpha_2,…\\alpha_r}$可以表出${\\beta_1,\\beta_2,…\\beta_s}$，且$r&lt;s$，那么${\\beta_1,\\beta_2,…\\beta_s}$一定线性相关。 子空间要证明某个集合是子空间，只需要证明加法和数乘满足封闭性即可。 线性相关与线性无关一般写成$k_1\\alpha_1+…+k_s\\alpha_s$的形式，然后再去考虑原问题。 向量组的秩推论3若向量组$\\beta_1,…,\\beta_r$可以由向量组$\\alpha_1,…,\\alpha_s$表出，如果$\\beta_1,…,\\beta_r$线性无关，那么$r \\le s$. 命题3如果向量组(I)可以表出向量组(II)，那么$r(I) \\ge r(II)$ 扩展主对角占优矩阵的行列式不为0 基和维数感觉没啥要注意的了。 矩阵的秩有两个比较重要的式子：$$rank\\begin{bmatrix}A\\ 0\\newline 0 \\ B\\end{bmatrix}=rank(A)+rank(B)\\newlinerank\\begin{bmatrix}A\\ C\\newline 0 \\ B\\end{bmatrix} \\ge rank(A)+rank(B)\\newline$$剩下的操作都是一些比较基础的，比如说设行或者列的极大线性无关组然后再去进行一些奇怪的操作。 线性方程组有解需要注意的只有$rank(A)=rank(\\widetilde{A})$ 齐次线性方程组解的结构$A\\vec{x}=0$的解集${\\vec{x}}$也叫作$W$，有$\\dim W=n-rank(A)$，然后是基础解系与解空间： $\\eta_1,\\eta_2,…,\\eta_s$彼此线性无关，且可以表示出所有的解，那么就是一个基础解系，这个可以用高斯消元做出来。 剩下的可能也是一些纯运算，感觉没看到什么非常有意思的东西。 非齐次…如果是非齐次的话，加一个特解就好了，好像不是考察的重点所以先pass。 第四章矩阵乘法$A*B$等价于A的列向量*B对应列的对应向量的和，也等价于$B$的行*A的对应行的对应向量的和. 特殊矩阵$P(j,i(k))$表示把第i行*k加到第j行上，或者把第j列*k加到第i列。 循环位移矩阵 ：$$C=\\begin{pmatrix}0\\ 1\\ 0 \\ 0\\ 0 …\\ 0\\0\\ 0\\ 1\\ 0\\ 0 … \\ 0\\…\\1\\ 0\\ 0\\ 0\\ 0 … \\ 0\\end{pmatrix}$$ 奇数级斜对称矩阵行列式为0 幂零矩阵和幂零指数：使$A^l=0$成立的最小正整数$l$. 矩阵乘积的秩与行列式一些比较有意思的东西是用$Ax=0$的解空间去做，从而得出$rank(A)=n-\\dim W$ 以及说明一些定义： 主子式：A的一个行和列的指标对应相等。 Binet-Cauthy公式：$$|A_{s\\times n} \\times B_{n\\times s}|=f(x)=\\begin{cases}0&amp; s&gt;n\\A和B中任意s阶子式的乘积&amp; s\\le n\\end{cases}$$矩阵求逆 $A^{-1}=\\frac{1}{|A|}A^*$,$A^*$是伴随矩阵，且$A^*(i,j)=A_{ji}$ 对合矩阵：$A^2=I$，称$A$为对合矩阵。 矩阵分块$AB=A(\\beta_1,\\beta_2,\\cdots,\\beta_m)=(A\\beta_1,A\\beta_2,\\cdots,A\\beta_m)$ Sylvester秩不等式：$rank(AB)\\ge rank(A)+rank(B)-n$ Frobenius秩不等式：$rank(ABC) \\ge rank(AB)+rank(BC)-rank(B)$ 幂等矩阵：$A^2=A$. 从这里我们得到了一个非常有意思的做法： 考虑对矩阵求逆，也就是我们要解一个$A*A^{-1}=I$，那么我们不妨把$A^{-1}$的列向量写出来，然后就等价于有$n$个方程。 剩下的就是纯代数知识了，我感觉很妙。 还有一个比较喵的: $\\forall A_{s\\times n},B_{n\\times s}$，有$|I_s-AB|=|I_n-BA|$ 正交矩阵$T*T’=I$ 施密特正交化：$\\beta_i=\\alpha_i-\\sum_{j=1}^{i-1}\\frac{\\alpha_i\\cdot \\beta_j}{\\beta_j \\cdot \\beta_j}\\beta_j$ 若A可逆，则$A=T*B$：做法是把A的列向量先正交化再单位化。 $(\\alpha,\\beta)$表示两个向量的点积，正交投影即$(\\alpha-\\alpha_0,\\beta)=0,\\forall \\beta \\in U$。 最小二乘解：$|\\beta-Ax_0| \\le |\\beta-Ax|$，$x_0$就是最小二乘解。 线性映射值域：$\\text{Im} f$ 恒等映射：$1_s$表示$\\forall x \\in S,f(x)=x$ 合成映射：$(fg)(a)=f(g(a))$ 逆映射：$fg=1_{s^{‘}},gf=1_s$，称$g$为$f$的逆映射，记作$f^{-1}$，存在逆映射等价于$f$是双射。 线性映射$Ax=\\beta$，很明显$\\text{Im}A=&lt;\\alpha_1,\\dots,\\alpha_s&gt;$，也就是$A$的列空间。 映射的核：$\\text{Ker} \\sigma={\\alpha \\in \\mathbb{K}^n|\\sigma(\\alpha)=0}$ $\\dim \\text{Ker}A + \\dim \\text{Im}A=\\dim \\mathbb{K^n}$ 第五章等价这一章就是一些定义： 等价关系：满足传递性，对称性和反身性的二元关系 等价类，具有等价关系的元素所构成的集合 划分：若干个不相交的子集的并为全集 等价类构成的集合记作$\\pi \\sim (S) $ 商集$S/\\sim$：$S$的所有等价类构成的集合，里面的元素是子集而不是元素。 矩阵的相抵$A\\sim B$：$A$可以通过初等行|列变化变成$B$。 Thm1. 若$rank(A)=r$，则$A\\sim^{相抵} \\begin{pmatrix}I_r\\ \\ 0\\0 \\ \\ \\ 0\\end{pmatrix}$ ==定义：==不变量指对于一个等价类中所有元素作用后结果相同，完全不变量指可以完全决定一个等价类 有两个很有意思的例题： 例6. 设$A$是$n$阶对称矩阵，且$rank(A)=r$，那么： A至少有一个$r$阶主子式不为0 A的所有不为0的$r$阶主子式的符号相同 **例8. **$rank(AB)=rank(A) \\Leftrightarrow ABX=A$有解 广义逆矩阵(选学)目的是为了方便的解出$Ax=\\beta$在$|A|=0$时的解 考虑$AA^{-1}A=A$，所以$A^{-1}$是$AXA=A$的一个解。 $AXA=A$在$A!=0$的情况下一定有解，而且令$A=P\\begin{pmatrix}Ir\\ 0\\0\\ \\ \\ 0\\end{pmatrix}Q$，那么特解为$Q^{-1}\\begin{pmatrix}Ir\\ B\\C\\ \\ \\ D\\end{pmatrix}P^{-1}$，且记$A^{-}=Q^{-1}\\begin{pmatrix}Ir\\ B\\C\\ \\ \\ D\\end{pmatrix}P^{-1}$，这就是广义逆矩阵。 $Ax=\\beta$的通解为$\\gamma=A^{-}\\beta$ $Ax=0$的通解是$x=(I-A^{-}A)Z_1$,$Z_1$为$\\mathbb{K^n}$的任意列向量。 所以推论为$Ax=\\beta$的通解为$x=A^{-}\\beta+(I-A^{-}A)Z_1$ *Moore-Penrose广义逆($A^{+}$)： 为某一个方程组的唯一解，若$A=BC$，通式为$C^(CC^)^{-1}(B^B)^{-1}B^*$。 矩阵的相似$A\\sim B \\Leftrightarrow P^{-1}AP=B$ 矩阵的迹：$$tr(A)=\\sum_{i=1}^na_{ii}$$相似不变量：矩阵的迹，秩，行列式 注意到迹这个东西非常的有用，可以用它来反证一些结论。 例题13：若实数域下$A \\sim B$不成立，则复数域下也不成立。 可对角化：$A\\sim D$ 条件：存在$n$个$\\mathbb{K^n}$下的线性无关的列向量$\\alpha$，$s.t. A\\alpha_i=D_{ii}\\alpha_i$ 矩阵的特征值和特征向量考虑上述条件有$A\\alpha=\\lambda\\alpha$，称$\\lambda$为$A$的特征值，$\\alpha$为$A$的特征向量。==注意$alpha \\neq 0$== 求解特征值：$|\\lambda I-A|=0$的解。 几何重数：以$\\lambda$作为特征值的特征子空间$U$的$\\dim $ 代数重数：特征多项式以$x=\\lambda$为解的重数 几何重数$\\le$代数重数 矩阵可对角化充要条件1：存在$n$个线性无关的特征向量 充要条件2：每一个特征根的几何重数=代数重数 实对称矩阵对角化实对称矩阵一定可对角化，而且是正交相似于特征值所构成的矩阵。 即$T^{-1}AT=diag{\\lambda_1,\\cdots,\\lambda_n}$ 其他的证明感觉需要多往数学归纳法上面靠。 第六章二次型矩阵的合同：存在$P$，s.t.$$P’AP=B$$非退化线性替换:$$X=CY$$若$C$是正交矩阵，称为正交替换。 二次型的标准形明显唯一——惯性定理 正惯性指数：$y_1^2+…+y_p^2-y_{p+1}^2-…-y_r^2$，$p$叫做正惯性指数，$r$为秩，$r-p$为负惯性指数。 复二次型的标准形只和秩相关。 正定的性质： 正定=正惯性指数为$n$=$A \\simeq I$=$A$的特征值全部大于$0$=$A$的所有顺序主子式$&gt;0$. 半正定、负定、半负定类似可得。 如何判断一个矩阵是不是正定矩阵？用顺序主子式","link":"/2022/12/27/%E7%BA%BF%E6%80%A7%E4%BB%A3%E6%95%B0%E4%B8%8A%E5%86%8C/"},{"title":"地震概论复习","text":"zkc老师周五班的笔记 第一章 - 地震学的研究范围和历史什么是地震学 地震是一种自然现象。全球每年发生500万次地震，人们可以感觉的仅占1%，造成严重破坏的7级以上的大地震约有18次，8级以上的特大地震1~2次。全世界有6亿多人生活在强震带上。我国是个多地震国家，20世纪以来，我国发生了800多次6级以上的地震，平均每年约8次；（可以作为开卷的参考） 历史记载全球死亡超过20万人的地震有6次，其中在中国就有4次。 上个世纪约有200万人死于地震，预计二十一世纪将有约1500万人死于地震。（这个内容在最后一节课也有提到，所以应该是很重要的） 地震学的基本名词和概念 震源、震中、震源深度、震中距离、发震时刻、地震波 烈度、烈度表、等震线（烈度相等的点连成的线）和震级(M)。 地震序列 主震型：例如汶川大地震 震群型（大小部分） 天然地震的分类 成因分：构造地震、火山地震、陷落地震 震源深度分：（*了解） &lt;60km: 浅源地震 60~300km: 中源地震 &gt;300km：深源地震 最深约为700km，因为温度高会熔化 按震中距分：只需要了解近震和远震 近震： &lt;1000km 远震：&gt;1000km 地方震： &lt;100km 给个简单的例子：唐山地震对北京而言是近震。 按震级分： 弱震：M&lt;3的地震 有感地震：3$\\le$M$\\le$4.5的地震 中强震：4.5&lt;M&lt;6的地震 强震：M$\\ge$6的地震。其中M$\\ge$8的地震又称为巨大地震。 地震学发展简史1966年邢台地震，推进了1971年中国地震局的成立。（只有中国有地震局这种机构） 第二章 - 地震波地震波弹性介质地球介质：均匀、连续、所受的力很小，延续时间很短，一般可以视为完全弹性体。 弹性性质：应力和应变，$\\sigma= E\\varepsilon$，胡克定律 脆性性质 塑性性质 弹性常量教员说不要求掌握 地震横波和纵波无界弹性介质中存在两种：$$V_s=\\sqrt{\\frac{\\mu}{\\rho}}\\newlineV_p=\\sqrt{\\frac{E}{\\rho}}$$$V_s$表示横波，$V_p$表示纵波，一般$V_p=\\sqrt{3}V_s$,$E$和$\\mu$是弹性介质的属性。 切变模量$\\mu$为0的介质中横波不能通过。 地震波的类型体波 体变 - P波 切变 - S波 地震的时候波几乎是垂直到达地表的，这是因为地球介质疏密的原因 可以把S波分解为平行界面的$SH$波和垂直界面的$SV$波。 下面的是核心 S波和P波的区别： P波更快，地震图上先出现P波。 P波和S波质点振动方向相互垂直 一般情况下，三分量地震图上P波垂直分量相对较强，S波水平分量相对较强。 S波的低频成分比P波丰富，P波高频成分更丰富 天然地震的震源破裂通常剪切破裂和剪切错动为主，震源向外辐射的S波的能量比P波的强。 P波通过时，质元无转动运动，而有体积变化，P波是一种无旋波。（没有旋转）S波通过时，质元有转动，而无体积变化， S波一种无散的等容波。（旋转产生，体积没有变化） 面波 - 半无限空间特征：随着深度增加衰减很快，有频散特征。 Love（勒夫）波 Rayleigh（瑞利）波 面波是指沿地球表面传播的,在与界面相垂直的方向上,波动的振幅急剧衰减。 在地震记录上，面波的振幅一般比体波大。 面波的能量被捕获在表面才能沿着或近地表传播，在伦敦的圣保罗大教堂 “耳语长廊”或中国天坛回音壁的墙面上捕获的声波就是面波。 不同周期的面波,其渗透深度不同；周期愈大的波,其渗透深度愈大。 在半无限的均匀介质中,不产生勒夫波,而且它所产生的瑞利波没有频散。地震记录中出现勒夫波以及有频散的瑞利波，则说明地下的介质是不均匀的或是成层的。 地球自由震荡分类： 球形 环形 脉动 实际地震记录中，除了地震产生的振动之外，记录显示并不是一条直线，而会有一些背景噪声或脉动 地震波的波序P波-&gt;S波-&gt;勒夫面波-&gt;瑞利面波-&gt;地震尾波 第三章 - 地震波传播理论地震波传播的基本概念 在一般的地震波计算中，地球介质可以做为各向同性的完全弹性体来对待。 首波：沿着下端界面走。 地震波是衰减的，$A=A_0e^{\\gamma t}$ 震中距：从震中到观测台的距离。也可以用度表示（圆心和震中的连线与圆心和观测台连线的夹角），1度$\\approx$110千米地震波传播的基本理论 费尔马定理：地震波总是走走时最短的方向。 斯涅耳定律：考虑$L$相同，然后求$t$和$x$的关系式，要求$\\frac{dt}{dx}=0$，此时就可以解出Snell定律。 高频近似：地震波的特征波长远小于所研究问题的特征尺度。这也是费尔马定律成立的条件。地震波的折射、反射和转换近震情况（平面） SV和P波可以互相转换，但是SH波只能转换出SH波。（因为SH垂直平面，投影总是0；但是SV和P波是平行于平面的。） 直达波、反射波和首波：令$X$为震中距，当$X \\ge x_m$时，首波会最先到达。远震情况（球体） 球对称介质中的Snell定律：$\\frac{r_1\\sin \\theta_1}{v_1}=\\frac{r_2\\sin \\theta_2}{v_2}$ 地震波的走时曲线和走时方程 震源在地表(h=0)：震中距越远，时间就变长。 直达波的走时：$t=\\frac{x}{v}$ 反射波的走时：$t=\\frac{2}{v}\\sqrt{h^2+\\frac{x}{2}^2}$ 首波的走时：$t=\\frac{2H}{v_1cos\\theta_c}+\\frac{x-2H\\tan \\theta_c}{v_2}$，当$x&gt;x_c=2h\\tan \\theta_c$ 震源不在地表(h!=0)： 直达P波和直达S波：记为$Pg$和$Sg$。 $t_p\\approx \\frac{X}{\\alpha_1},t_s\\approx \\frac{X}{\\beta_1}$ 可以用来估算震中距：$X\\approx 8km/s \\times (t_s-t_p)$ 地壳底面反射波震相：记为PmP和SmS $t_{PmP}\\approx \\frac{X}{\\alpha_1},t_{SmS}\\approx \\frac{X}{\\beta_1}$ 首波震相，分别记为Pn和Sn $t_{Pn}=\\frac{2H-h}{v_{\\alpha_1}\\cos i_c}+\\frac{X-(2H-h)\\tan i_c}{v_{\\alpha_2}},t_{Sn}=\\frac{2H-h}{v_{\\beta_1}\\cos i_c}+\\frac{X-(2H-h)\\tan i_c}{v_{\\beta_2}}$ 临界震中距$\\Theta_{c_1}$和$\\Theta_{c_2}$，分别表示存在首波的临界震中距和首波最先到达的临界震中距。 体波各种震相和走时表近震体波震相对于近震，最主要的速度间断面就是莫霍面了。以Pg、Sg表示地壳内由震源发出直接到达地面的纵波和横波。P、S波到达莫霍面后的反射波有可能产生转换波，因此经莫霍面的反射波表示为PmP、PmS、SmP、SmS。而经莫霍面的首波则表示为Pn、Sn。 远震体波震相 P代表由震源向地幔朝下的纵波，S代表由震源向地幔朝下的横波 p代表由震源向地表朝上的纵波，s代表由震源向地表朝上的横波 小写字母c表示在地核面反射的情况，可能有PcP,PcS,ScP,ScS 大写字母K表示通过地核的波，通过后只有可能出现P波。所以K代表的就是纵波。 P’表示PKP，也就是P波在外核反射一次重新回到地幔。 在内核界面的反射叫做i，通过内核的P波叫做I，通过内核的S波叫做J。 几个主要震相的特征 P：在震中距为100度的范围内，P将作为地震记录的第一个震相清晰地显示出来。一超过103度，其振幅就变小，这是因为进入地核的阴影区所致。当看到弱小的波时，一般认为那是在核幔边界上由于衍射而产生的，这类似于莫霍面衍射的Pn波。 S：在震中距最大为100度的范围内，S往往以比P还大的振幅在地震记录上显示出来。超过100度时，虽然开始进入了地核隐区。P和S的到时差确定震中距。 PP、SS（地面反射波）：这两个震相在震中距超过20度是就开始与P或S分离。 pP、sS：当发生深震时，在30-100度附近，在P、S之后可以清晰的显示出来。pP和P的到时差，以及sS和S的到时差，往往随着震源深度不同而差别很大，因此对确定震源深度非常有用。$t_{sS}-t_S=\\frac{2h}{\\beta},t_{pP}-t_P=\\frac{2h}{\\alpha}$ PcP、ScS、pPcP、sScS（外核反射波）：PcP、ScS或者是PcS、ScP常在震中距在30-40度左右显示出来。 地震走时表定义：地震波在不同震中距上传播的时间表。 有的射线是不存在的（约束条件：Snell定理）比如说PcPS。ScSP是可能存在的。 第四章 - 地球内部的结构地球内部结构的发现 1522年地球是圆的宣告成立。 地壳不是地球最硬的部分。地球内核是固体，最硬。 - 1909年，首波，发现地壳底部。 - 1906年，发现影区，发现外核。 - 1936年，影区中发现地震信号，发现内核。 地壳的厚度在全球各处是不同的。大陆地区，地壳平均厚度为35公里，但横向很不均匀，如我国青藏高原下面的地壳厚度达60～80公里，而华北地区有些地方，还不到30公里。海洋地壳的厚度只有5～8公里。 有些地区，上下层中间存在一个速度间断面，叫康拉德（Conrad）面，或C界面。但在另一些地区，观测不到来自C界面的震相。Conrad面并不是全球都有的，有的地方有，有的地方没有。 研究大洋和大陆地壳的区别，要用纯路径面波。面波通过地球表面的路径通常既穿过大洋，又穿过大陆。但在特殊情形下，有些地震台能记录到仅通过大陆地壳或海洋地壳的纯路径面波。 由于地幔内部又存在410公里和670公里（全球平均）两个地球二级速度间断面，地幔分为上地幔、过渡层及下地幔三个层区。 古登堡面为什么不叫作奥尔德姆面： 古登堡更精确地计算了地核深度。 古登堡利用了反射震相。 古登堡利用了更丰富的地震记录。现代观测对地核深度的估计值2891公里与这一数值（2900km）仅有几公里的误差。 英格·莱曼发现地球内核，影区中发现地震信号。 应用地震波去透视地球内部首先要研究地震图。 地球内部的圈层结构壳幔界面、幔核界面、内外核界面和上下地幔之间的过渡层比较明显： 壳幔界面：莫霍面（M面） 幔核界面：古登堡面（G面） 内外核分界面：莱曼面（L面） 上下地幔的过渡层：布伦划分。 反演问题结果反推，不一定准确。 反演地震层析成像与地球内部三维结构为了获得地球内部完整的结构图，我们需要从一维或者二维过渡到全球三维图像，半径+经纬度（球坐标）。这样一个数字仪器台网，它能够以宽频记录到全球大于6级的地震。主要方法： 体波（射线理论） 面波 接收函数法 第五章 - 地震机制断层一些定义 断层是沿破裂面两侧岩块发生显著相对位移的断裂构造。 岩层断裂错开的面称断层面。 冷的脆性岩石容易发生脆性破裂（断层），从而导致天然地震。 断层滑动开始的地方叫震源, 震中是震源在地表的垂直投影 断层的术语 断层上盘 /断层下盘 上盘：压在上面的 下盘：被压在下面的 走向：站在断层地表面上，规定上盘在右手的面对方向为走向，正北方向和走向的顺时针夹角为走向大小（规定为0°~360°） 倾角：断层面和水平面的夹角（规定为0°~90°） 滑移：描述断层的上盘相对于下盘滑动的方向。 断层的分类 正断层：上盘向下，下盘向上 逆断层：上盘向上，下盘向下 走滑断层 左旋右旋：站在一盘看，另一盘往哪里走就是什么旋。 斜滑断层：除了上面的情况就是斜滑 弹性回跳原理1906年，里德(Reid)提出。 地震引起的振动源于破裂面。破裂起始的表面开始很小，很快扩展得非常大，但是其扩展速率不会超过岩石中P波的传播速度； 应力：压强，应变：无量纲，就是一个百分比。 地震效率＝地震波能量／地震能，约为$7.5%\\sim 15%$ 破裂前,能量以弹性应变能储存 过程： 断层附近的介质发生变形，并蓄积着应变能。较弱的地方开始发生微破裂（地震前兆） 当应力超过一定的限度时，断层开始破裂并释放应力。这就是主地震。 断层调整（余震）。 弹性回跳理论只是一个理论模型，真实的地震过程可能相当的复杂。 震源机制解沙滩球模型挤压 - 黑色拉伸 - 白色 沙滩球下半小球在地表面的投影。 举例正断层：中间白色两边黑色逆断层：中间黑色两边白色走滑断层：四等分 正断层比较陡，逆断层比较缓（考虑重力作用）。可以用来识别断层面。 板块构造学说现在仍然是一种假说，还没有被证明。 历史17世纪以前 - 灾变说1785年 - 苏格兰地质学家James Hotton提出均变原理19世纪中叶 - 均变说被广泛接受19世纪末20年代初 - 地质构造的运动主要是垂直向的，横向运动只是垂向运动的副产品。 1915年，德国气象学家魏格纳（Alfred Lothar Wegener，1880－1930）提出“大陆漂移假说”。 海底扩张：海洋岩石记录过去的磁场。洋中脊是会不断扩张的。20世纪50年底，海底扩张假说，Hess。 大陆不是穿过海洋漂移，而是随着海洋一起漂移 Hess估计海洋的年龄最老不超过300百万年。 海洋地壳的沉积层薄。 科学预测：大洋中脊应该有热泉存在。 地磁条带沿中脊对称分布 六大板块：美洲板块、欧亚板块、南极板块、印度洋板块、非洲板块、太平洋板块 强调3次的内容：扩散边界 - 正断层汇聚边界 - 逆断层转换边界 - 走滑断层，连接两个扩散边界。 海沟处 - 逆断层洋中脊 - 扩散边界/转换边界（正断层/走滑断层） 全球地震活动概况1960年5月22日，智利9.5级大地震，有仪器纪录以来最大震级的地震。**加强人口密集区地震监测与地震防范是减轻地震灾难的有效途径。 ** $$\\lg E = 11.8+1.5M$$ $E$代表地震波能量，单位是尔格，$M$表示震级。 震级差一级，能量差$32$倍。（统计学规律）震级差两级，能量差$1000$倍。 **大约全球百分之八十的浅震、百分之九十的中源地震以及全部深震都集中在环太平洋地震带上。 ** 不同类型的地震天然地震 构造地震：占90%以上 火山地震 陷落地震 92%的地震发生在地壳中，其余的发生在地幔上部。上半地壳地震多，多于$46%$。 人工地震水库地震、地下核爆等。 鉴别地下核试验的地震学方法方法 震中位置和震源深度 波形复杂性 初动解：核爆炸是全黑图案。 P波与S波振幅比 ：$核爆炸P波振幅大于S波振幅$。 地震波频谱 震级比（$M_b:M_s$） 第六章 - 地震仪及地震基本参数的测定定义：地震仪(seismograph)是一种可以接收地面振动，并将其以某种方式记录下来的装置。仅记录地震波到达时间的仪器只能叫验震器。 张衡的候风地动仪 1875年，服部一三，文字变猜想图形。 1951年，王振铎，变成展览模型。 2008年，科学复原，变成科学仪器，具有了科学生命。 地动仪是验震器，它没有时间记录（而且不明显）。而且摆的方向也不一定能惟一地显示出震源方向，只能确定在这条直线上。张衡地动仪判断陇西地震是巧合。 失传的原因：其实是没有什么用处（可能是生锈了）。 “封建统治者的无能！”——zkc 现代地震仪 第一台实用地震仪：1880至1890，访日的英国人约翰·米尔恩、詹姆斯·尤因和托马斯·格雷，在日本研制出记录地震动随时间变化的第一架具有科学意义而且较为实用的地震仪。 原理：惯性 地面运动可以是位移、速度或加速度，它们是随时间变化的三维矢量，为了研究完整的地面运动，一定要将这三个分量（上下、东西和南北）都记录下来。 地震图也被称为地震记录 常见的地震仪一般由拾震器、放大器（换能器）及记录系统三个部分组成。 地震台与地震观测台网指利用各种地震仪器进行地震观测的观测点赛德台，米尔恩，1895年。由于米尔恩对地震观测的贡献，他被称为现代地震学的奠基人。 地震定位三个台获取不同的到时差，然后画3个圆，交点就是震中距。如果要获得震源深度，就还需要一个台。今天在世界的多数地区，震中定位的精度大约为10千米，震源深度的精度更差，大约为20千米。 震级测定常用里氏震级来标准区分，由地震学家查尔斯·里克特1935年在美国加州理工学院发明的，最初只用于衡量南加州当地的地震的大小，现在全世界地震的研究都使用这种分级系统。阈值很小，级别不大。 里氏震级$M_L$是最大地震波振幅以10为底的对数。选择距震中100千米的距离为标准，伍德-安德森的特殊地震仪，精确度$0.001mm$。$M_L=\\lg A$，比如说$1cm$就是$\\lg 10000=4$ 震级本身没有任何上下限，可以存在-2.0级地震（砖头掉到地上）。 地震台常用的震级有3种新的$M_S,M_b,M_w$，$M_L$对于比较大的地震是不准确的，比如说$M_L=8$，那振幅$A=100m$。 面波震级$M_S$：选择周期近20秒的面波的最大振幅计算震级，$M_S$震级不能用于深源地震 $M_b$，它是根据P波的大小而不是根据面波的大小确定地震的震级 $M_L,M_S,M_b$都是里氏震级系统（取对数），没有物理意义。 对于特大型地震，用里氏系列的震级标度测量将出现“饱和”问题。用震级描述地震的大小或强度非常方便，但是这个参数没有物理意义。 地震矩1966年美国地震学家安艺提出，是岩石的弹性刚度、施力的面积和突然滑移中断裂的位错量三者的乘积，能解决里氏震级的问题，可以描述从最小到最大的地震震级变化。现在人们多半都计算地震的矩震级，记为$M_w$ 不同台站即使测定同一个地震的震级值也会有所不同，一般认为，震级的测定精度在0.3左右。 强震加速度及加速度地震仪 近震、强震记录的需要 工程地震的需要 地震信息的完整 第七章 - 地震预报特点地震灾害与其他灾害不同的特点： 突发性较强 破坏性大，成灾广泛 社会影响深远 防御难度大 次生灾害多 持续时间长 地震灾害具有某种周期性 1975年2月4日辽宁海城7.3级地震，唯一一次成功的地震预报。但1976年唐山大地震就给大家当头一棒1996年Robert Geller提出地震不能预报 地震预测地震预测不是预报，科学家只能预测（是个方案），预报是一个社会行为。 精度低（周期包络？而非精确日期）地震重复返回周期分析（活动断层应变能积累）而非地震前兆识别基于地震重复返回周期分析而不是基于地震前兆的识别 地震预报不等于地震预测。地震预测的精度差，地震预报要求三要素（时间、地点、震级大小）。在公众的语言中，甚至在专业人士中，对“地震预测”和“地震预报”一般不加区分，并且通常指的就是这里所说的“地震短、临预测”。精度最差的就是时间。方法：地震地质、地震统计、地震前兆 地震预报的方法 地震地质方法 地震统计方法 不确定性关系 方法有：极值预报、震中迁移的预报、地震序列的概率预报 、周期图方法 资料要多 地震前兆方法 古登堡－里克特关系 ：$\\log N = a-bM$，$N$为地震次数，$M$为地震震级。b值偏低时,则可能发生大震 地震空区理论：地震空区 - 有地震倾向、地震的能量释放低于平均水平的区域。zkc预测：“日本东京会有8.0以上的大地震。” 帕克菲尔德地震预报实验：22年周期被打破。 地震横波纵波的波速比变化 地下水位和化学成分的变化 地震与电磁现象 根据地面形变进行预报 其它：地面倾斜、地应力、P波残差、P波和S波的振幅比、日月引力的诱发作用、地球自转速度变化与地震的关系、气象异常、电磁波异常、动物习性异常等等 迄今地震学家仍未探索出一种确定性的地震前兆。也就是说，尚未找到任何一种异常现象，可以在所有大地震之前必被无一例外地观测到；并且一旦出现这种异常现象，必无一例外地发生大地震 。 1975年2月4日辽宁海城7.3级地震！ 地震预报的进展、困难、前景略。“预报”的地震震级很精确，发震时间、地点很具体的传闻是谣传；跨国地震预报是谣传；地震小道消息是谣传；凡带有封建迷信色彩和离奇古怪传说的地震传闻更是谣传。 应震措施毒气 - 垂直风的方向跑 第八章 - 宏观地震学烈度一次破坏对某一地区的影响和破坏程度（I） 烈度和震级的区别： 震级唯一（绝对值），烈度不唯一（相对值）。 烈度是宏观标准，震级是微观标准。 中国是12度表，前苏联（俄罗斯）是10度表，日本是7度表。 基本烈度：一个地区未来50年内一般场地条件下可能遭受的具有10%超越概率的地震烈度值称为该地区的基本烈度，相当于475年一遇的最大地震的烈度，基本烈度也称为偶遇烈度或中震烈度。 设防烈度：按国家规定的权限批准作为一个地区抗震设防依据的地震烈度称为设防烈度，用Id表示。注意，抗震设防一定是按照烈度，而不是震级。比如说7度和7级就不一样！ 注意，抗震设防一定是按照烈度，而不是震级！！注意，抗震设防一定是按照烈度，而不是震级！！注意，抗震设防一定是按照烈度，而不是震级！！ 地震的宏观现象和宏观调查 宏观现象：原生现象、次生现象。 宏观地震调查：强地震的调查、前兆现象的调查、历史地震的调查与考证、宏观地震资料的整理 决定强地面震动的因素 地面运动最大加速度 地面运动的周期：共振 强震的持续时间 地震的破坏作用（震害作用） 直接灾害 建筑物和构筑物的破坏 地面破坏 山体等自然物的破坏 海啸 次生灾害 火灾（关东大地震） 水灾 毒气泄漏 瘟疫 工程结构破坏现象 工程地震学 目标：小震不坏，中震可修，大震不倒。 研究近场地震，不研究远场（影响小） 应用：地震区划抗震设计原则（选择场地和地基）： 尽可能避开产生强烈地基失效及其它加重震害地面效应的场地或地基。 考虑到地基土石的卓越周期和建筑物的自振周期 岩溶地区地下不深处有大溶洞 避免以加重震害的孤立突出地形作为建筑场地。 决定任何场点地面震动的强度的因素有3个： 震源机制。 震源与该场点之间岩石的不均匀性和结构变化。 该场点的土壤和其他地质条件: 盆地效应和盆地边缘效应。 基岩上地震动幅值小、持续短、震害轻；淤泥和填充地则放大地震波，像震动地果冻碗一样。 面波比体波衰减慢、振幅大、周期长、传播远。建筑物破坏主要由面波造成。 为什么民众现在感觉地震多了？ 面波比体波衰减慢、振幅大、周期长、传播远。人们感受到地震波多为面波。（体波衰减没了） 随着全球城市化进程，人们住在高层建筑中，能感知比以前在低矮住房更多的地震。 高耸建筑物受低频震荡的影响较大，而低矮建筑受高频震荡的影响较大。在宏观烈度大体相同条件下，处于大震级远离震中的高耸建筑物的震害比中小级震级近震中距的情况严重的多。 第九章 - 勘探地震学应用在石油勘探中的技术 石油勘探的方法 地质法：分析来自地表的底层、岩石，对深层的地下构造最多有个大概的了解。 地球物理法：简称物探法，间接探测的方法，勘测范围深，效率高。 重力勘探：利用岩石密度的差异。 磁性勘探：利用岩石磁性的差异。 电法勘探：利用岩石电阻率的差异。 地震勘探：利用演示波阻抗的差别，精度搞，分辨率高，占97%。简称：重磁电震 钻探法：直接获取深层地下的物质情况，成本昂贵。 自大庆油田开发以来，95%的新油田都是由地震勘探提供构造的。 天然地震学： 被动源方法（天然地震产生的地震波场，守株待兔） 勘探地震学：主动源方法（人工震源，尺度小） 折射地震学 反射地震学 地震勘探技术（具体了解不做要求） 野外采集阶段 室内资料处理阶段： 观测系统的加载，坏道和初至的剔除，增益的恢复，静校正（）。 去噪声 速度分析 叠加和偏移：通过多道数据求平均的思想来消除部分噪音，因此叠加之前必需做好静校正和动校正 地震资料的解释阶段——核心，定位钻井，精度不是很高。 一般来说就是20%~25%，能够到达30%就算不错的水平了。 分为：构造解释、岩性解释 仅作了解： “怪坡”是假的。说明：所谓“怪坡”是指物体可以自行上坡的奇异现象 什么在求取地下构造信息时，以反射波取代折射波？ 折射波在地质条件复杂的情况下, 容易导致解释错误。说明：约束条件少，解析解数目多。 反射波信噪比高，易辨识。 勘探地震学与天然地震学的区别 研究的对象不同； 地震采集的方式不同； 地震采集的仪器也有所差别。 实际应用中应综合前人已经做出的成果、钻井的资料、重力数据、地磁数据、地质资料等来进行解释。 第十章 - 海啸最大的海啸：2004年12月26日，印度洋海啸。 海啸的形成海啸通常由海底地震引起，地震发生时断层两侧的板块如果产生垂直方向的相对位移，最可能引发海啸的是断层破裂面在海底地表的逆冲断层地震。海水回退—&gt;赶紧跑。产生条件：地震要发生在深海区，地震震级要大和具备开阔并逐渐变浅的海岸条件 $m=2.61M﹣18.44$，$m$是海啸等级，$M$为地震震级。 太平洋海啸预警中心发布海啸警报的必要条件是：海底地震的震源深度小于60km，同时地震的震级需要大于7.8级。 海啸的特点多数海水中的波都是表面波（声波除外），其特性导致海水中质点的运动在海面处最大。海啸是一种浅水波（$d&lt;&lt;\\lambda$），$v=\\sqrt{g*d}$，主要与深度有关，波长和周期频率影响不大（可能有影响但是影响不大！）。海啸具有长波长，能量大和传播速度快三个特点。每小时可达$700-900km$。海啸的周期可达$1$小时，波长可达几百$km$。印度洋海啸能量大约是两千颗广岛原子弹的能量 。将近是8.1~8.2级。 海啸的分类按照成因分 地震海啸（占主要）：“下降型”海啸和“隆起型”海啸（隆起型占主要）。 火山海啸 滑坡海啸按照相对距离分（分类是相对的） 近海海啸 远洋海啸 海啸灾害全球有记载的破坏性较大的海啸约发生260次，平均六七年发生一次。其中发生在环太平洋地区上的海啸约占80%，发生在地中海区的约占8%，而在日本列岛及其邻近海域发生的海啸则占太平洋地区的60%左右。二千年以来，中国只发生过10次地震海啸，平均200年左右才出现一次。对中国远洋海啸的可能性：中国的海域大都是浅水大陆架地带。向外延伸远，海底地形平缓而开阔，不像印度洋海啸影响的许多地区那样，海底逐渐由深变浅，中间没有一个平缓的缓冲带。中国沿海地区发生海啸的可能性低的分析：海水深度、地质构造、外部环境（岛弧拱卫）、海岸地形1965年，26个国家和地区进行合作，在夏威夷建立了太平洋海啸警报中心（PTWC）。海啸几乎是不可能准确预测的，如果在海滩或邻近海的地方感到地震，应马上向高处跑去海啸预报的准确度比地震高。 第十一章 - 汶川大地震 上世纪200万人死于地震，全球有6亿人生活在强震带上。 震级从7.8改为了8.0 机理：青藏高原向东挤压应力持续释放的结果 与唐山大地震对比：震级更大，能量差3倍，死亡人数更少。 *了解： 北京CBD中人跑出大楼VS北大人没有感觉：面波——频率低、周期长、衰减慢、传播远，与高楼会共振。 成都没啥影响： 地理条件好 逆冲断层 被动冲比较慢 国家台网的作用：快速准确测定 破裂过程研究正确解释地震灾害——发现北川比汶川更严重 余震研究实现实时大规模研究 玉树地震可能与它有影响。 柔层破坏：对1楼造成影响比较大——剪切应力大 电影 - 《大地震》剧情梳理：省略到一些不太重要的爱情线，只专注于地震斯图尔特是一个建造工程师，起初他和他的妻子雷米因为他过去的同事的遗孀丹尼斯而争吵，雷米认为斯图尔特与他有奸情，于是装服毒药结果被突如其来的地震给戳破。与此同时，好莱坞大坝上有震感，两个检测员其中之一展开了检测，却被淹死在了电梯井里。新闻报道上午7：46洛杉矶发生尼科特氏3.1级轻微地震。另一边，Ray警官因为追查到某个郡中而失去追逃犯的权限，一怒之下重拳向同事挥去，使得自己被革职。加州地震协会的罗素认为48h内将会发生大地震，将数据发给博士但对方因在外地安装测量地震波幅的仪器没有收到，同事不相信罗素的推断，但其实这个时候博士已经因为塌方埋在了土里。罗素认为这场地震至少是里氏震级7.0以上，另一个博士表达了对罗素的轻视，但是对这些数据私底下非常的重视。地震协会监测到一次不轻的地震，对应着大坝上出现的裂痕，以及水位上升半寸。丹尼斯让她的儿子出去随便逛逛，而她在散步的时候发现了附近狗的不正常，罗莎（机车女郎）在看电影的时候发生了地震，丹尼斯儿子从桥上坠地。大楼里的人们疯一般的跑向电梯，结果电梯线断了然后自由落体全部寄了。斯图尔特岳父在办公楼内劝慰大家不要恐慌，打破窗户使烟尘散开，组织大家撤离。因为楼梯拥挤，有人被挤出大楼坠地身亡。大楼内充满磷酸，经过椅子和灭火枪的绳子才平安脱险，但是斯图尔特岳父身体异常不适，后来发现是心脏病犯了（最终死亡）。摩托车手和同伴帮助丹尼斯和她的儿子脱离险境，到了好莱坞广场。Ray警官拦住了斯图尔特的车，让他开车去救人。余震发生后人们出现恐慌，雷米、丹尼斯等被困在地下三层，斯图尔特和Ray冒着生命危险打洞救出众人，结果因为水坝坍塌导致雷米被水流冲走，在影片的最后斯图尔特毅然跳入水中去救雷米，可惜两人都被冲走（估计是都淹死了） 影片一共地震4次，感觉告诫大家地震的时候不要坐电梯。还发生了火灾，磷酸毒（烟气），水灾等一系列次生灾难。 注意事项海啸计算题技巧：浅水波$$v=\\sqrt{gh}$$如果$h$变化均匀，可以用始末的速度平均值代替平均速度。 考试注意事项网上考试都考选择题， 12月16号6：40~7：10，百分制，有补考但是建议别搞（只有84）。 20套试卷，6：35会公布你用哪一套卷子，开卷考试，独立完成。 35道左右的题目（34~36） 在教学网-&gt;教学内容-&gt;期末考试里查看试卷，千万别点错 把所有的作业做成满分，可以多做很多次。 12月26号出成绩 还书可以等到下学期开学第一周星期五6：40去二教101 睿频收录了一些在听回放的时候听到的好玩的东西。 “领导的话原封不动的转达，任何时候都不要骂领导。”——zkc“我见人说人话，见鬼说鬼话，成功的秘诀就在于随机应变。富贵险中求。”——zkc“有机缘的时候就要谈一场恋爱，失败的恋爱也有意义，不要等到你父母催婚。”——zkc“最牛逼的人他们是造势，我们要趟浑水，趁机喝点汤。”——zkc“你在北大看到好看的单身女老师，马上给我报告，这个时候我就可以给你展示一下我的泡妞大法了。”——zkc“大机会是在国家兴存和灭亡的时候，大灾难来了，机会就来了。”——zkc“最长寿的男人的身高是160~170cm之间啊。”——zkc“你绝对不能打游戏，你泡个同专业的妹子多好啊。”——zkc“男怕入错了行，你要当科学家你也要找个有肉的地方啃，你抱着骨头那不是找死吗？”——zkc“男士要多锻炼身体，不然以后等你死了你老婆会做什么事情，那就不好说了，那可不一定就只是帽子问题啊。”——zkc","link":"/2022/12/12/%E5%9C%B0%E9%9C%87%E6%A6%82%E8%AE%BA%E5%A4%8D%E4%B9%A0/"},{"title":"A Plan for 1Fall","text":"期末考试 2022.12.19 信息科学中的物理学 下午 2022.12.19 高等数学 晚上 2022.12.20 汉英翻译 晚上6:30~8:30 2022.12.21 计算概论 下午 2022.12.22 思修 晚上 18:30~20:30 2022.12.25 计概大作业答辩 上午10:30 2022.12.28 线性代数 上午 2022.12.30 地震概论 晚上18:40~19:15 35min 30题 信息科学技术概论 pf 论文+讲座 军事理论 申请缓考 形势与政策 论文已交 Week 15 计概大作业查漏补缺 + MCTS 1day 周三 地概复习 * 1day 周一+周四+周五 高数复习 * 2days 周六周日 信物复习 * 1day 周三+周日+下周一上午 汉英翻译复习 * 1day 周四+下周二 计算概论复习 * 0.5 day 下周三 Week 14 汉英翻译记得传承诺书 信物ppt复习 高数作业 地震概论复习2章 计概大作业 MCTS选做 计概期末练习 信概论文 - AI","link":"/2022/12/08/a-plan/"},{"title":"热力学基础","text":"期末寄快到了，抓紧时机复习一下。 第五章 - 气体动理论一些比较基础的 $$pV=nRT,R=8.314$$ $$\\overline{v_x^2}=\\overline{v_y^2}=\\overline{v_z^2}=\\frac{1}{3}\\overline{v}^2$$ 微观与宏观的转换——压强$$P=\\frac{F}{S}=\\frac{N\\times \\frac{I}{t}}{S}= \\frac{NI}{tS}\\newlinep=\\frac{3}{2}n\\overline{\\varepsilon_k^2}\\newline\\overline{\\varepsilon_k^2}=\\frac{3}{2}kT$$ 温度是大量气体分子热运动的集体表现，具有统计意义：对个别分子或少数几个分子，说它有温度是没有意义的，这就是“寒风凛冽是正确的”的解释。 $$v_{rms}=\\sqrt{\\overline{v^2}}=\\sqrt{\\frac{2RT}{M}}$$ 一个气体分子：$$\\overline{\\varepsilon_k^2}=\\frac{i}{2}kT$$ 许多许多的气体分子：$$E=n\\frac{i}{2}RT$$ 一些比较高级的 mb分布$$f(v)=4\\pi (\\frac{m_0}{2\\pi kT})^{\\frac{3}{2}}exp(-\\frac{m_0v^2}{2kT})v^2$$ mb分布改写成最概然速率 $$f(v)=4\\pi (\\frac{1}{\\pi v_p^2})^{\\frac{3}{2}}exp(-\\frac{v^2}{v_p^2})v^2$$ 最概然速率:$v_p=\\sqrt{\\frac{2RT}{M}}$ 方均根速率:$v_{rms}=\\sqrt{\\overline{v^2}}=\\sqrt{\\frac{3RT}{M}}$ 平均速率:$\\overline{v}=\\sqrt{\\frac{8RT}{\\pi M}}$ 写成和能量相关的形式：$$f(E)=Aexp(-\\frac{-E}{RT})$$$A$的求法要用归一化来求 斯特林公式近似：$$\\ln n!=n\\ln n-n$$ 熵的定义：$k$乘微观态数目$W$的对数$$S=k\\ln W$$ 温度的定义：$$\\frac{1}{T}=\\frac{dS}{dE}$$ 负温度的存在：考虑统计意义下的负温度，能级有上限，若符合mb分布，那么若$N_0&gt;N_1$，则$T&gt;0$；若$N_0&lt;N_1$，则$T&lt;0$。 热力学热力学4条定律 达到热平衡的两个系统温度相同，热平衡具有传递性。 $Q=\\Delta E+ A$，$\\delta Q=dE+\\delta A$。 熵增加。 绝对零度不能到达。 准静态过程的计算$dE =\\frac{m}{M} C_{v,m}dT$ 等体过程$A=\\int pdV=0$，$Q=A+\\Delta E=\\int \\frac{m}{M} C_{v,m}dT$ 等压过程$A=p\\Delta V=nR\\Delta T$，$Q=A+\\Delta E=nR\\Delta T+nC_{v,m}\\Delta T = nC_{p,m}\\Delta T$ 等温过程$\\Delta E=0$，$Q=A=\\int pdV = \\frac{m}{M}RT\\ln \\frac{V_2}{V_1}=\\frac{m}{M}RT\\ln \\frac{p_1}{p_2}$ 绝热过程$Q=0$，$A=-\\Delta E$，$\\Delta E=\\int \\frac{m}{M}C_{v,m}dT$ $\\gamma = \\frac{i+2}{i}$ $pV=nRT$，对其求导然代换后积分可得：$pV^\\gamma=Const$ 绝热条件下$p-V$曲线变化比等温条件下更快。 气体输运 平均自由程和平均碰撞频率：$$\\overline{Z}=\\pi d^2n v_r, \\ \\overline{\\lambda}=\\frac{\\overline{v}}{\\overline{Z}}=\\frac{1}{\\sqrt{2}\\pi d^2 n}$$ 然后可以用$p=nkT$来进行代换，这里就不写了。","link":"/2022/12/07/%E7%83%AD%E5%8A%9B%E5%AD%A6%E5%9F%BA%E7%A1%80/"},{"title":"一些感想","text":"3e8454c16ad922b9d6ef31f7de0cd983737fde7145a55a94a656c811b67ff4f49b9e3e9c97be3274e021d9c745e1ced8ebbfc6c2c64a201a2166eeaa07641b5ae9d20c2b4d82d1e51a09c22a01aa11cbd838888b596ed7352438a9551c90a820ea32ede3b6b808e593af9a6be572f3e2ac2eaf2510024825e2972edb998f1f7df497182ff5e263b4e707fc4019b044d30496399bbe8141ca54d4b0f5f4d4b52d8f1dc87f4fc0ff4407d22e3a28e4a382b9b1ce643a790fbf89b692a6dc2f326dd6c1e8ea3263d41df9467a505b85bf1ab2355f77924d7deedec40be94a6395da8e5b35a5230fdcad168e49f8f2c72be3de0eb75db98c4b78b71953b645e4e9e1aef82e82fcbed9aa41360eb3e3a8fcdc27aeabc7c11b57681de0ab1e2e9708b35b3264b7a40d991d59e66608f3dd9db9db64266e5e6371a3c1390076507d603bd83655c597aceaceb6362ad125aba95a7c1d9e04182b5ea9dfcc82356b9d7f982521796d9a594dec9a635837b0b98d3b97b51cd3643956cc4e383293e8a9d7b1daedc3214793a7e90b7235636780571d3f0dedb0b3c76c87771266a71d1338d14e7e197e4f9b6fb4fcacb33c501e1ccde90b96d3033fc5aba7a1e74e619f1d630ea676eaac2a29e83eacc8df72f44d8c2a3f0976b0ec73f9f65fb44405d23a88c4aad5e7a34849f0cb30bc99f9c7aa6b59c391dea2bbbdf7ae8e5c5b7bb7802e1dd62f91e54ef050a98c7e0b4a534a5c1491f96ddf07081ff64b867236be491e3185664d035c2b90e0746efa6c071ca7987cd6cd88095bf09515e5ac21edc9f19dea0e3d0544732202805f2ecae9f0b23291248976e2b00a0d880b7409f88ce919a9237eab6d9fa5dbb1aa8d2cb0462b1e49185ef7e35d3a19c1099985539e4a2adfa837c246c652bd220725439746536ec277f51fd2fa62fe76360235306228359e7d6cadcc0edae4993826d3c3153de20f753a71a002e6362c37009b50db0ca08495ac80ab87752983fc7726f6fd65783233d6c8e1246542add909c92990e492233073a59d9ac8eda2abfd40d870ff7bd9198120ce887b8572dec71db4af9888ccf20856b057460d6bac8f9e65890c698cd55c98692bdb9cbaccd32b0aafce13b4c8a25924e33ffd9db1d33c47487e886538dc786f8473602ca008576cf48268d701560bfcb0835e3e381218e453f05771760bab777abf916c7e6e14fed0ac07e0c3428abc9a66c668192346f388494828112d615947b4a0d8b293b03ed6f7e61b58775ea484c109455255d273e2990c9e4b7f4b2129fbfb82f792c858ef5ea791234f74c6905a5751835ec2c8eb082cc522db29ee40054788f260d08d6a95ee9ae522fcd6301b38695ed7969ee84bb5bae8e5d314554e914ba2917ad697e6f895e85eebde9e22e6c0571e25fa4840b013b42d78bcf9a064b064c508ad95c3d80746473156e6a8f53794671effd60c13fe27f79f662bbd3d888ab5bc520151e25795cb73c1ac235642b4ec84e9fd34708131b6640c30016f47e8e728eb4034 您好, 这里需要密码.","link":"/2022/12/06/%E4%B8%80%E4%BA%9B%E6%84%9F%E6%83%B3/"},{"title":"Hello World","text":"大概是2022年的12月5日吧，感觉自己还是要有一点地方来记录一些属于自己的想法。 所以就还是在Windows下搭建了一个Hexo的博客得益于性能优秀的LenovoY9000x笔记本电脑 很久不见，以及，你好世界 1printf(&quot;Hello World!\\n&quot;);","link":"/2022/12/05/hello-world/"}],"tags":[{"name":"物理","slug":"物理","link":"/tags/%E7%89%A9%E7%90%86/"},{"name":"其他","slug":"其他","link":"/tags/%E5%85%B6%E4%BB%96/"},{"name":"计划","slug":"计划","link":"/tags/%E8%AE%A1%E5%88%92/"},{"name":"课程测评","slug":"课程测评","link":"/tags/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"},{"name":"地震概论","slug":"地震概论","link":"/tags/%E5%9C%B0%E9%9C%87%E6%A6%82%E8%AE%BA/"},{"name":"线代","slug":"线代","link":"/tags/%E7%BA%BF%E4%BB%A3/"},{"name":"数学","slug":"数学","link":"/tags/%E6%95%B0%E5%AD%A6/"}],"categories":[{"name":"笔记","slug":"笔记","link":"/categories/%E7%AC%94%E8%AE%B0/"},{"name":"其他","slug":"其他","link":"/categories/%E5%85%B6%E4%BB%96/"},{"name":"大学生活","slug":"大学生活","link":"/categories/%E5%A4%A7%E5%AD%A6%E7%94%9F%E6%B4%BB/"},{"name":"随笔","slug":"随笔","link":"/categories/%E9%9A%8F%E7%AC%94/"}],"pages":[{"title":"About","text":"长郡中学2022届毕业生，北京大学2022级本科生，现就读于信息科学技术学院。 最近沉迷于Steam无法自拔，同时渴望在大学中继续摆烂。","link":"/about/index.html"}]}